Sub pldm_bsent_columns()
'----------------------------------------------------------------------------------------------------------------------------
'Обновление листа "Рабочий лист"
'----------------------------------------------------------------------------------------------------------------------------
Set CallerBook = ThisWorkbook
Set DGBook = Workbooks("Интерфейс.xlsm")
'----------------------------------------------------------------------------------------------------------------------------
    DGBook.Worksheets("Рабочий лист").Select
    Columns("A:G").Select
    Selection.Clear
    DGBook.Worksheets("Отсутствующие столбцы").Select
    Columns("A:G").Select
    Selection.Copy
    DGBook.Worksheets("Рабочий лист").Select
    Columns("A:G").Select
    ActiveSheet.Paste
    Range("A2").Select
'----------------------------------------------------------------------------------------------------------------------------
    Application.EnableCancelKey = xlInterrupt
'----------------------------------------------------------------------------------------------------------------------------
End Sub
