
Sub update_comm()
'----------------------------------------------------------------------------------------------------------------------------
'Актуализация комментариев таблиц
'----------------------------------------------------------------------------------------------------------------------------
Set CallerBook = ThisWorkbook
Dim TimeStamp As String
'----------------------------------------------------------------------------------------------------------------------------
Debug.Print "Открытие соединения DSN" & Now()
Dim db As ADODB.Connection
Set db = New ADODB.Connection
db.ConnectionString = "DSN=TD_RDV"
db.Open
db.CommandTimeout = 0
'----------------------------------------------------------------------------------------------------------------------------
'Указатель на номер строки
'----------------------------------------------------------------------------------------------------------------------------
rownumber = 2
'----------------------------------------------------------------------------------------------------------------------------
Do While CallerBook.Worksheets("Обновление комментариев").Cells(rownumber, 1).Value <> ""
'----------------------------------------------------------------------------------------------------------------------------
'пока нет пустой строки
'----------------------------------------------------------------------------------------------------------------------------
PTABLE_ID = Worksheets("Обновление комментариев").Cells(rownumber, 1).Value                 'ID таблицы
PBDOM_NAME = Worksheets("Обновление комментариев").Cells(rownumber, 2).Value                'Наименование БО
PTABLE_COMMENT = Worksheets("Обновление комментариев").Cells(rownumber, 3).Value            'Комментарий таблицы (актуальный)
'----------------------------------------------------------------------------------------------------------------------------
If PBDOM_NAME <> "" And PTABLE_COMMENT <> "" Then
            'SqlCode01 = "insert into PRD_DB_DMT.PLDM_BDOM_TABLE_LNK (TABLE_ID,BDOM_ID)" & Chr(10) & Chr(13) &
                '"values (" & PTABLE_ID & "," & PBDOM_ID & ")"
            'db.Execute (SqlCode01)
            
            SqlCode03 = "update PRD_DB_DMT.PLDM_TABLE set TABLE_COMMENT= " & "'" & PTABLE_COMMENT & "'" & " where TABLE_ID=" & PTABLE_ID & "  "
            db.Execute (SqlCode03)
End If
'----------------------------------------------------------------------------------------------------------------------------
    rownumber = rownumber + 1
'----------------------------------------------------------------------------------------------------------------------------
Loop
'----------------------------------------------------------------------------------------------------------------------------
    Range("A2:D2").Select
    Range(Selection, Selection.End(xlDown)).Select
    Selection.ClearContents
'----------------------------------------------------------------------------------------------------------------------------
    Sheets("Обновление комментариев").Select
    Selection.ListObject.QueryTable.Refresh
'----------------------------------------------------------------------------------------------------------------------------

db.Close
End Sub
