
Sub delete_not_exist_table()
'----------------------------------------------------------------------------------------------------------------------------
'Удаление неактульных таблиц. Удаление всех связей
'----------------------------------------------------------------------------------------------------------------------------
Set CallerBook = ThisWorkbook
Dim TimeStamp As String
'----------------------------------------------------------------------------------------------------------------------------
Debug.Print "Открытие соединения DSN" & Now()
Dim db As ADODB.Connection
Set db = New ADODB.Connection
db.ConnectionString = "DSN=TD_RDV"
db.Open
db.CommandTimeout = 0
'----------------------------------------------------------------------------------------------------------------------------
'Указатель на номер строки
'----------------------------------------------------------------------------------------------------------------------------
rownumber = 2
'----------------------------------------------------------------------------------------------------------------------------
Do While CallerBook.Worksheets("Удаление неактуальных витрин").Cells(rownumber, 1).Value <> ""
'----------------------------------------------------------------------------------------------------------------------------
'пока нет пустой строки
'----------------------------------------------------------------------------------------------------------------------------
PTABLE_ID = Worksheets("Удаление неактуальных витрин").Cells(rownumber, 1).Value                 'ID таблицы
PTABLE_NAME = Worksheets("Удаление неактуальных витрин").Cells(rownumber, 2).Value               'Наименование БО
'----------------------------------------------------------------------------------------------------------------------------
If PTABLE_ID <> "" Then

            SqlCode01 = "delete from PRD_DB_DMT.PLDM_BDOM_TABLE_LNK WHERE TABLE_ID = " & PTABLE_ID & ";"
            db.Execute (SqlCode01)
            
            SqlCode02 = "delete from PRD_DB_DMT.PLDM_TABLE WHERE TABLE_ID = " & PTABLE_ID & ";"
            db.Execute (SqlCode02)
            
            SqlCode03 = "delete from PRD_DB_DMT.PLDM_TABLE_COLUMN_LNK WHERE TABLE_ID = " & PTABLE_ID & ";"
            db.Execute (SqlCode03)
        
End If
'----------------------------------------------------------------------------------------------------------------------------
    rownumber = rownumber + 1
'----------------------------------------------------------------------------------------------------------------------------
Loop
'----------------------------------------------------------------------------------------------------------------------------
    Range("A2:B2").Select
    Range(Selection, Selection.End(xlDown)).Select
    Selection.ClearContents
'----------------------------------------------------------------------------------------------------------------------------
    Sheets("Удаление неактуальных витрин").Select
    Selection.ListObject.QueryTable.Refresh
'----------------------------------------------------------------------------------------------------------------------------
db.Close
End Sub

