Sub update_comment_DM()
'----------------------------------------------------------------------------------------------------------------------------
'Обновление комментариев полей в модели данных
'----------------------------------------------------------------------------------------------------------------------------
Set CallerBook = ThisWorkbook
Dim TimeStamp As String
'----------------------------------------------------------------------------------------------------------------------------
Debug.Print "Открытие соединения DSN" & Now()
Dim db As ADODB.Connection
Set db = New ADODB.Connection
db.ConnectionString = "DSN=TD_RDV"
db.Open
db.CommandTimeout = 0
'----------------------------------------------------------------------------------------------------------------------------
'Указатель на номер строки
'----------------------------------------------------------------------------------------------------------------------------
rownumber = 2
'----------------------------------------------------------------------------------------------------------------------------
Do While CallerBook.Worksheets("Обновление комментариев полей").Cells(rownumber, 1).Value <> ""
'----------------------------------------------------------------------------------------------------------------------------
'пока нет пустой строки
'----------------------------------------------------------------------------------------------------------------------------
'дата обработки
SqlCode01 = "(SELECT CAST(CURRENT_TIME AS TIMESTAMP(0)) DTMWhenProcessed)"
Set dt = db.Execute(SqlCode01)
dttime = Format(dt!DTMWhenProcessed, "YYYY-MM-DD HH:MM:SS")
'----------------------------------------------------------------------------------------------------------------------------
PCOLUMN_ID = Worksheets("Обновление комментариев полей").Cells(rownumber, 3).Value                  'ID поля
PTABLE_ID = Worksheets("Обновление комментариев полей").Cells(rownumber, 1).Value                   'ID таблицы
PCOLUMN_NAME = Worksheets("Обновление комментариев полей").Cells(rownumber, 4).Value                'Наименование поля (Модель данных)
PCOLUMN_COMMENT_PRD = Worksheets("Обновление комментариев полей").Cells(rownumber, 5).Value         'Комментарий поля (PRD)
PCOLUMN_COMMENT = Worksheets("Обновление комментариев полей").Cells(rownumber, 6).Value             'Комментарий поля (Модель данных)
PIS_COLUMN_COMMENT_TRUE = Worksheets("Обновление комментариев полей").Cells(rownumber, 7).Value     'Флаг актуального комментария: 0 - комментарий PRD;1 - комментарий модели данных
'----------------------------------------------------------------------------------------------------------------------------
If PCOLUMN_ID <> "" And PIS_COLUMN_COMMENT_TRUE <> "" Then
            
            If PIS_COLUMN_COMMENT_TRUE = 0 Then
        
            
            SqlCode01 = "Update PRD_DB_DMT.PLDM_COLUMN SET COLUMN_COMMENT = " & "'" & PCOLUMN_COMMENT_PRD & "'" & ", CHANGE_DTM = " & "'" & dttime & "'" & " WHERE COLUMN_NAME = " & "'" & PCOLUMN_NAME & "'" & " AND COLUMN_ID = " & "'" & PCOLUMN_ID & "'" & ";"
            db.Execute (SqlCode01)
            
            Else
        
            SqlCode03 = "Update PRD_DB_DMT.PLDM_COLUMN SET COLUMN_COMMENT = " & "'" & PCOLUMN_COMMENT & "'" & ", CHANGE_DTM = " & "'" & dttime & "'" & " WHERE COLUMN_NAME = " & "'" & PCOLUMN_NAME & "'" & " AND COLUMN_ID = " & "'" & PCOLUMN_ID & "'" & ";"
            db.Execute (SqlCode03)
            End If
            
End If
'----------------------------------------------------------------------------------------------------------------------------
    rownumber = rownumber + 1
'----------------------------------------------------------------------------------------------------------------------------
Loop
'----------------------------------------------------------------------------------------------------------------------------
    Range("A2:G2").Select
    Range(Selection, Selection.End(xlDown)).Select
    Selection.ClearContents
'----------------------------------------------------------------------------------------------------------------------------
    Sheets("Обновление комментариев полей").Select
    Selection.ListObject.QueryTable.Refresh
'----------------------------------------------------------------------------------------------------------------------------
db.Close
End Sub


