Sub update_comment_table()
'----------------------------------------------------------------------------------------------------------------------------
'Обновление комментариев таблиц в модели данных
'----------------------------------------------------------------------------------------------------------------------------
Set CallerBook = ThisWorkbook
Dim TimeStamp As String
'----------------------------------------------------------------------------------------------------------------------------
Debug.Print "Открытие соединения DSN" & Now()
Dim db As ADODB.Connection
Set db = New ADODB.Connection
db.ConnectionString = "DSN=TD_RDV"
db.Open
db.CommandTimeout = 0
'----------------------------------------------------------------------------------------------------------------------------
'Указатель на номер строки
'----------------------------------------------------------------------------------------------------------------------------
rownumber = 2
'----------------------------------------------------------------------------------------------------------------------------
Do While CallerBook.Worksheets("Описанные витрины").Cells(rownumber, 1).Value <> ""
'----------------------------------------------------------------------------------------------------------------------------
'пока нет пустой строки
'----------------------------------------------------------------------------------------------------------------------------
PTABLE_NAME = Worksheets("Описанные витрины").Cells(rownumber, 1).Value               'Наименование таблицы
PTABLE_COMMENT = Worksheets("Описанные витрины").Cells(rownumber, 2).Value            'Комментарий таблицы
PTABLE_ID = Worksheets("Описанные витрины").Cells(rownumber, 3).Value                 'ID таблицы
'----------------------------------------------------------------------------------------------------------------------------
If PTABLE_NAME <> "" Then
            
            SqlCode03 = "update PRD_DB_DMT.PLDM_TABLE set TABLE_COMMENT= " & "'" & PTABLE_COMMENT & "'" & " where TABLE_ID=" & PTABLE_ID & "  "
            db.Execute (SqlCode03)
End If
'----------------------------------------------------------------------------------------------------------------------------
    rownumber = rownumber + 1
'----------------------------------------------------------------------------------------------------------------------------
Loop
'----------------------------------------------------------------------------------------------------------------------------
    Range("A2:C2").Select
    Range(Selection, Selection.End(xlDown)).Select
    Selection.ClearContents
'----------------------------------------------------------------------------------------------------------------------------
    Sheets("Описанные витрины").Select
    Selection.ListObject.QueryTable.Refresh
'----------------------------------------------------------------------------------------------------------------------------
db.Close
End Sub

