Sub update_column_type()
'----------------------------------------------------------------------------------------------------------------------------
'Обновление типов данных в справочнике полей
'----------------------------------------------------------------------------------------------------------------------------
Set CallerBook = ThisWorkbook
Dim TimeStamp As String
'----------------------------------------------------------------------------------------------------------------------------
Debug.Print "Открытие соединения DSN" & Now()
Dim db As ADODB.Connection
Set db = New ADODB.Connection
db.ConnectionString = "DSN=TD_RDV"
db.Open
db.CommandTimeout = 0
'----------------------------------------------------------------------------------------------------------------------------
'Указатель на номер строки
'----------------------------------------------------------------------------------------------------------------------------
rownumber = 2
'----------------------------------------------------------------------------------------------------------------------------
Do While CallerBook.Worksheets("Отсутствует тип данных у поля").Cells(rownumber, 1).Value <> ""
'----------------------------------------------------------------------------------------------------------------------------
'пока нет пустой строки
'----------------------------------------------------------------------------------------------------------------------------
PCOLUMN_ID = Worksheets("Отсутствует тип данных у поля").Cells(rownumber, 1).Value               'ID поля Наименование таблицы
PCOLUMN_NAME = Worksheets("Отсутствует тип данных у поля").Cells(rownumber, 2).Value             'Наименование поля
PCOLUMN_TYPE = Worksheets("Отсутствует тип данных у поля").Cells(rownumber, 3).Value             'Тип поля
'----------------------------------------------------------------------------------------------------------------------------
If PCOLUMN_TYPE <> "" Then
            
            SqlCode03 = "update PRD_DB_DMT.PLDM_COLUMN  set COLUMN_TYPE= " & "'" & PCOLUMN_TYPE & "'" & " where COLUMN_ID=" & PCOLUMN_ID & "  "
            db.Execute (SqlCode03)
End If
'----------------------------------------------------------------------------------------------------------------------------
    rownumber = rownumber + 1
'----------------------------------------------------------------------------------------------------------------------------
Loop
'----------------------------------------------------------------------------------------------------------------------------
    Range("A2:D2").Select
    Range(Selection, Selection.End(xlDown)).Select
    Selection.ClearContents
'----------------------------------------------------------------------------------------------------------------------------
    Sheets("Отсутствует тип данных у поля").Select
    Selection.ListObject.QueryTable.Refresh
'----------------------------------------------------------------------------------------------------------------------------
db.Close
End Sub
