Sub delete_table_column_lnk()
'----------------------------------------------------------------------------------------------------------------------------
'Удаление связей полей и таблиц
'----------------------------------------------------------------------------------------------------------------------------
Set CallerBook = ThisWorkbook
Dim TimeStamp As String
'----------------------------------------------------------------------------------------------------------------------------
Debug.Print "Открытие соединения DSN" & Now()
Dim db As ADODB.Connection
Set db = New ADODB.Connection
db.ConnectionString = "DSN=TD_RDV"
db.Open
db.CommandTimeout = 0
'----------------------------------------------------------------------------------------------------------------------------
'Указатель на номер строки
'----------------------------------------------------------------------------------------------------------------------------
rownumber = 1
'----------------------------------------------------------------------------------------------------------------------------
Do While CallerBook.Worksheets("Удаление связей полей и таблиц").Cells(rownumber, 5).Value <> ""
'----------------------------------------------------------------------------------------------------------------------------
'пока нет пустой строки
'----------------------------------------------------------------------------------------------------------------------------
PTABLE_ID = Worksheets("Удаление связей полей и таблиц").Cells(rownumber, 5).Value                 'ID таблицы
PCOLUMN_ID = Worksheets("Удаление связей полей и таблиц").Cells(rownumber, 7).Value                'ID поля
PIS_DELETE = Worksheets("Удаление связей полей и таблиц").Cells(rownumber, 10).Value                'Признак удаления
'----------------------------------------------------------------------------------------------------------------------------
If PIS_DELETE <> "" Then
            
            SqlCode03 = "delete from PRD_DB_DMT.PLDM_TABLE_COLUMN_LNK WHERE TABLE_ID = " & PTABLE_ID & " AND COLUMN_ID = " & PCOLUMN_ID & ";"
            db.Execute (SqlCode03)
        
End If
'----------------------------------------------------------------------------------------------------------------------------
    rownumber = rownumber + 1
'----------------------------------------------------------------------------------------------------------------------------
Loop
'----------------------------------------------------------------------------------------------------------------------------
    Range("E1:J1").Select
    Range(Selection, Selection.End(xlDown)).Select
    Selection.ClearContents
'----------------------------------------------------------------------------------------------------------------------------
db.Close
End Sub

