Sub BSEG()
'----------------------------------------------------------------------------------------------------------------------------
'Добавление бизнес-сегмента,
'           связи бизнес-сегмента и бизнес-области,
'           обновление информации в справочнике таблицы
'           добавление связи бизнес-области и таблицы
'----------------------------------------------------------------------------------------------------------------------------
Set CallerBook = ThisWorkbook
Dim TimeStamp As String
'----------------------------------------------------------------------------------------------------------------------------
Debug.Print "Открытие соединения DSN" & Now()
Dim db As ADODB.Connection
Set db = New ADODB.Connection
db.ConnectionString = "DSN=TD_RDV"
db.Open
db.CommandTimeout = 0
'----------------------------------------------------------------------------------------------------------------------------
'Указатель на номер строки
'----------------------------------------------------------------------------------------------------------------------------
rownumber = 2
'----------------------------------------------------------------------------------------------------------------------------
Do While CallerBook.Worksheets("Бизнес_сегмент").Cells(rownumber, 3).Value <> ""
'----------------------------------------------------------------------------------------------------------------------------
'пока нет пустой строки
'----------------------------------------------------------------------------------------------------------------------------
PBSEG = Worksheets("Бизнес_сегмент").Cells(rownumber, 1).Value                        'ID Бизнес-сегмента
PBSEG_NAME = Worksheets("Бизнес_сегмент").Cells(rownumber, 2).Value                   'Наименование бизнес-сегмента
PPAGE_ID = Worksheets("Бизнес_сегмент").Cells(rownumber, 4).Value                     'ID страницы-родителя БО
PTABLE_ID = Worksheets("Бизнес_сегмент").Cells(rownumber, 7).Value                    'ID таблицы
PSRC_NAME = Worksheets("Бизнес_сегмент").Cells(rownumber, 9).Value                    'Источники
'----------------------------------------------------------------------------------------------------------------------------
If PBSEG <> "" And PBSEG_NAME <> "" And PSRC_NAME <> "" Then
'----------------------------------------------------------------------------------------------------------------------------
            SqlCode01 = "insert into PRD_DB_DMT.PLDM_BSEG (BSEG_ID,BSEG_NAME,BDOM_ID)" & Chr(10) & Chr(13) & _
                "values (" & PBSEG & "," & "'" & PBSEG_NAME & "'" & "," & PPAGE_ID & ")"
            db.Execute (SqlCode01)
            
            SqlCode02 = "insert into PRD_DB_DMT.PLDM_BDOM_TABLE_LNK(TABLE_ID,BDOM_ID)" & Chr(10) & Chr(13) & _
                "values (" & PTABLE_ID & "," & PPAGE_ID & ")"
            db.Execute (SqlCode02)
            
            If PSRC_NAME <> "" Then
            SqlCode03 = "update PRD_DB_DMT.PLDM_TABLE  set BSEG_ID = " & PBSEG & " , SRC_NAME = " & "'" & PSRC_NAME & "'" & " where TABLE_ID = " & PTABLE_ID & "  "
                db.Execute (SqlCode03)
            End If
End If
'----------------------------------------------------------------------------------------------------------------------------
    rownumber = rownumber + 1
'----------------------------------------------------------------------------------------------------------------------------
Loop
'----------------------------------------------------------------------------------------------------------------------------
    Range("A2:I2").Select
    Range(Selection, Selection.End(xlDown)).Select
    Selection.ClearContents
'----------------------------------------------------------------------------------------------------------------------------
    Sheets("Бизнес_сегмент").Select
    Selection.ListObject.QueryTable.Refresh
    Sheets("Бизнес_сегмент").Select
'----------------------------------------------------------------------------------------------------------------------------
db.Close
End Sub

