Sub Обновление()
'----------------------------------------------------------------------------------------------------------------------------
' Обновление данных витрины Absent
'----------------------------------------------------------------------------------------------------------------------------
Set CallerBook = ThisWorkbook
Set DGBook = Workbooks("Интерфейс.xlsm")
'----------------------------------------------------------------------------------------------------------------------------
    DGBook.Worksheets("Отсутствующие столбцы").Activate
    Selection.ListObject.QueryTable.Refresh
    DGBook.Worksheets("Рабочий лист").Activate
    'MsgBox ("Succeed")
    Range("A2").Select
'----------------------------------------------------------------------------------------------------------------------------
End Sub
