Sub CheckBOId()
'----------------------------------------------------------------------------------------------------------------------------
'Привязка Бизнес-области к полю\ям
'----------------------------------------------------------------------------------------------------------------------------
Set CallerBook = ThisWorkbook
Dim TimeStamp As String
'----------------------------------------------------------------------------------------------------------------------------
Debug.Print "Открытие соединения DSN" & Now()
Dim db As ADODB.Connection
Set db = New ADODB.Connection
db.ConnectionString = "DSN=TD_RDV"
db.Open
db.CommandTimeout = 0
'----------------------------------------------------------------------------------------------------------------------------
'Указатель на номер строки
'----------------------------------------------------------------------------------------------------------------------------
rownumber = 2
'----------------------------------------------------------------------------------------------------------------------------
Do While CallerBook.Worksheets("Привязка БО").Cells(rownumber, 1).Value <> ""
'----------------------------------------------------------------------------------------------------------------------------
'пока нет пустой строки
'----------------------------------------------------------------------------------------------------------------------------
PTABLE_ID = Worksheets("Привязка БО").Cells(rownumber, 1).Value               'ID таблицы
PBDOM_NAME = Worksheets("Привязка БО").Cells(rownumber, 4).Value              'Наименование БО
PBDOM_ID = Worksheets("Привязка БО").Cells(rownumber, 5).Value                'ID БО
'----------------------------------------------------------------------------------------------------------------------------
If PBDOM_NAME <> "" Then
            'SqlCode01 = "insert into PRD_DB_DMT.PLDM_BDOM_TABLE_LNK (TABLE_ID,BDOM_ID)" & Chr(10) & Chr(13) &
                '"values (" & PTABLE_ID & "," & PBDOM_ID & ")"
            'db.Execute (SqlCode01)
            
            SqlCode03 = "update PRD_DB_DMT.PLDM_BDOM_TABLE_LNK set BDOM_ID= " & PBDOM_ID & " where BDOM_ID=-1  and  TABLE_ID=" & PTABLE_ID & "  "
            db.Execute (SqlCode03)
End If
'----------------------------------------------------------------------------------------------------------------------------
    rownumber = rownumber + 1
'----------------------------------------------------------------------------------------------------------------------------
Loop
'----------------------------------------------------------------------------------------------------------------------------
    Range("A2:D2").Select
    Range(Selection, Selection.End(xlDown)).Select
    Selection.ClearContents
'----------------------------------------------------------------------------------------------------------------------------
    Sheets("Привязка БО").Select
    Selection.ListObject.QueryTable.Refresh
'----------------------------------------------------------------------------------------------------------------------------
db.Close
End Sub




